Задача алгоритмически не самая сложная, однако для полноценного выполнения проверочной работы необходимо:

1. Создать репозиторий на GitHub
2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)
3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)
4. Написать программу, решающую поставленную задачу
5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)

Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []


1. Создала репозиторий.
2. Нарисовала блок схему.
3. Этапы решения:
-Создаём метод PrintArray для вывода значений массива.
-Задаём размер массива.
-Объявляем массив arrayStrings.
-При помощи цикла for наполняем массив значениями.
-Объявляем массив arrayFinal.
-Объявляем две переменные length и count. length - количество символов в элементе, count - счетчик для определения длины финльного массива.
-Выполняем цикл for (int i = 0; i < size; i++) каждый раз проверяя условие: if (arrayStrings[i].Length <= length).
-Делаем отступ строки Console.WriteLine() и методом PrintArray выводим массив arrayFinal на экран.